src/InformationRegisters/ТекущиеЗначенияПроизводительности/ТекущиеЗначенияПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеЗначенияПроизводительности</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗамера</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетчикПроизводительности</name>
    <type>
      <types>CatalogRef.СчетчикиПроизводительности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОборудованиеОперативныеНастройки/ОборудованиеОперативныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборудованиеОперативныеНастройки</name>
  <attributes>
    <name>ДатаЗаписиUTC</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперативныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкОС</name>
    <type>
      <types>EnumRef.ЯзыкиСистемы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КомандыАгентаКИП/КомандыАгентаКИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомандыАгентаКИП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Команда</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>АгентКИП</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКоманды</name>
    <type>
      <types>EnumRef.ТипыКомандАгентаКИП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусКоманды</name>
    <type>
      <types>EnumRef.СтатусыКомандАгентаКИП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОборудованиеЛицензии1С/ОборудованиеЛицензии1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборудованиеЛицензии1С</name>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лицензия</name>
    <type>
      <types>CatalogRef.Лицензии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ОбщийВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПередНачаломРаботыСистемы(ЭтоМобильныйКлиент) Экспорт
	Возврат Общий.ПередНачаломРаботыСистемы(ЭтоМобильныйКлиент);
КонецФункции

Функция ТипПлатформыСервераСтрокой() Экспорт
	
	СистемнаяИнфо = Новый СистемнаяИнформация;
	
	Если СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		Возврат "Linux_x86";
		
	ИначеЕсли СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		Возврат "Linux_x86_64";
		
	ИначеЕсли СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		Возврат "Windows_x86";
		
	ИначеЕсли СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат "Windows_x86_64";
		
	ИначеЕсли СистемнаяИнфо.ТипПлатформы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция СохраненнаяВерсия() Экспорт
	Возврат Общий.СохраненнаяВерсия();
КонецФункции

Функция ВерсияЦКК() Экспорт
	Возврат Общий.ВерсияЦКК();
КонецФункции

Функция ИдетОбновление() Экспорт 
	Возврат Общий.ИдетОбновление();
КонецФункции

Функция СоздатьНачальногоПользователя() Экспорт
	Возврат Общий.СоздатьНачальногоПользователя();
КонецФункции

Функция НастройкаПараметровОповещенияВыполнена() Экспорт
	Возврат Общий.НастройкаПараметровОповещенияВыполнена();
КонецФункции

Функция ФормаПослеОбновления() Экспорт
    Возврат Константы.ПоказатьФормуПослеОбновления.Получить();
КонецФункции

#КонецОбласти

#Область ОбработчикиОжиданийФорм

Функция ШагМониторингНаСервере(Пользователь, УникальныйИдентификаторФоновогоЗадания) Экспорт
    
    ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторФоновогоЗадания);
    
    Если ФЗ.Состояние = СостояниеФоновогоЗадания.Активно Тогда
        
        КлючОбъекта = "МониторИнцидентов";
        КлючНастроек = "МониторИнцидентов";
        
        Попытка
            
            НачатьТранзакцию();
            
            БлокировкаДанных = Новый БлокировкаДанных;
            ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОбъектыБлокировок");
            ЭлементБлокировки.УстановитьЗначение("Объект", КлючОбъекта+КлючНастроек+Пользователь);
            БлокировкаДанных.Заблокировать();
            
            ДанныеХранилища = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек,,Пользователь);
            Если ДанныеХранилища = Неопределено Тогда
                ДанныеХранилища = Новый Соответствие;
                ДанныеХранилища.Вставить("ВыполнятьДо", ТекущаяУниверсальнаяДата());
                ДанныеХранилища.Вставить("Данные", Неопределено);
            КонецЕсли;
            
            ДанныеХранилища.Вставить("ВыполнятьДо", ТекущаяУниверсальнаяДата() + 60);
            ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, ДанныеХранилища,,Пользователь);
            
            ЗафиксироватьТранзакцию();
            
        Исключение
            
            ОтменитьТранзакцию();
            ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
            
        КонецПопытки;
        
        РезультатВыполнения = Новый Соответствие;
        РезультатВыполнения.Вставить("Данные", ДанныеХранилища["Данные"]);
        
    Иначе
        
        РезультатВыполнения = Новый Соответствие;
        РезультатВыполнения.Вставить("Ошибка", Истина);
        РезультатВыполнения.Вставить("ОписаниеОшибки", ПодробноеПредставлениеОшибки(ФЗ.ИнформацияОбОшибке));
        
        ЗаписьЖурналаРегистрации("МониторингИнцидентов", УровеньЖурналаРегистрации.Ошибка,,,РезультатВыполнения["ОписаниеОшибки"]);
        
    КонецЕсли;

    Возврат РезультатВыполнения;
    
КонецФункции

Функция ПроверитьСчетчикиПроизводительностиОбработчикОжиданияНаСервере(Оборудование) Экспорт
    
    Результат = Новый Структура;
    Результат.Вставить("Счетчики", РегистрыСведений.ТекущиеЗначенияПроизводительности.ПолучитьЗначения(Оборудование));
    Результат.Вставить("ОперативныеНастройки", РегистрыСведений.ОборудованиеОперативныеНастройки.ПрочитатьНастройки(Оборудование));
    
    Возврат Результат;
    
КонецФункции

Функция ПроверкаВыполненияКомандыАгентаПолучитьЛицензии1С(Оборудование, УникальныйИдентификаторКоманды) Экспорт
    
    РезультатВыполнения = РегистрыСведений.КомандыАгентаКИП.РезультатВыполнения(УникальныйИдентификаторКоманды);
    
    Если РезультатВыполнения <> Неопределено Тогда
        
        Если РезультатВыполнения["installed"] <> Неопределено И РезультатВыполнения["installed"] Тогда
            РегистрыСведений.ОборудованиеЛицензии1С.ЗагрузитьЛицензии(Оборудование, РезультатВыполнения["license"]);
        КонецЕсли;
        
    КонецЕсли;
    
    Возврат РезультатВыполнения;
    
КонецФункции

#КонецОбласти
